app/controllers/todo_controller.rb

SELECT * FROM `tasks` WHERE (user_id = 1)
---
  def index
    @tasks = Task.find_tasks(session[:userID])

SELECT * FROM `tasks` WHERE (`tasks`.`id` = 2)
UPDATE `tasks` SET `task_status_id` = 0, `updated_at` = '2009-03-27 06:24:59' WHERE `id` = 6
---
    task = Task.find(params[:id])
    task.task_status_id = "0"
    task.save

SELECT * FROM `tasks` WHERE (`tasks`.`id` = 3)
---
  def edit
    @task = Task.find(params[:id])

INSERT INTO `tasks` (`name`, `updated_at`, `task_status_id`, `memo`, `tag_id`, `list_id`, `user_id`, `due`, `created_at`) VALUES('ああ', '2009-03-27 05:26:45', 1, 'ああ', 1, 1, 1, '2009-03-25', '2009-03-27 05:26:45')
---
  def create
    @task = Task.new(params[:id])
    @task.user_id = session[:userID]

    if @task.save