app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `salt`, `updated_at`, `activated_at`, `crypted_password`, `deleted_at`, `remember_token_expires_at`, `activation_code`, `remember_token`, `login`, `email`, `created_at`, `state`) VALUES('', '9de282dbbfd033e41b6c7d8086ed31812649af5b', '2009-03-31 03:15:38', NULL, '39387c55e0a917dd2075f70ae2ebdb139dc6bc95', NULL, NULL, '59f6077627ab1f795e0da07c807af46cbd0b9dca', NULL, 'masaki', 'm-ogura@needswell.com', '2009-03-31 03:15:38', 'passive')
---
  def create
    logout_keeping_session!
    @user = User.new(params[:user])

    success = @user && @user.save